; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	thermograph1 - mode
	thermograph3 - mode
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star4 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star1 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
	(supports instrument8 thermograph3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation7)
)
(:goal (and
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 thermograph3)
	(have_image Star11 thermograph0)
	(have_image Star12 spectrograph2)
	(have_image Planet13 spectrograph2)
))

)

; plan
1. (turn_to satellite2 groundstation5 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 6
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 6
3. (calibrate satellite2 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 6
4. (turn_to satellite2 planet13 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet13)
   goals met: 0 of 6
5. (take_image satellite2 planet13 instrument5 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 1 of 6
6. (turn_to satellite2 planet10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet10)
   goals met: 1 of 6
7. (take_image satellite2 planet10 instrument5 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 2 of 6
8. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 6
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
10. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 6
11. (take_image satellite2 phenomenon9 instrument5 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 3 of 6
12. (turn_to satellite0 star11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
13. (take_image satellite0 star11 instrument1 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 4 of 6
14. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 4 of 6
15. (take_image satellite0 star12 instrument1 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 5 of 6
16. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 5 of 6
17. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 6 of 6
